[
  {
    "title": "YPG NCR and South Luzon General Assembly: \"ENCOURAGING PHARMACISTS’ INVOLVEMENT IN PHARMACOVIGILANCE\"",
    "date": "October 7, 2018",
    "url": "/ypg-ncr-and-south-luzon-ga-2018",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2428938760457234",
    "image": "https://scontent.fcrk1-1.fna.fbcdn.net/v/t1.0-9/42366140_2394971297187314_5154825984951713792_n.jpg?_nc_cat=104&_nc_eui2=AeG7EeYICTBa9gSzHDmcLJRV4qW6XY84nbUrwmogv_gPhmcEMbDbFhBmSiI0MN3ySyv-c7bQJ-DLnCkJKDM273ULnfrCE4sVL300oRK0zlj4fQ&oh=328ae36f55b603ef60d6a399b9ba0dd2&oe=5C159412",
    "description": "<p>Thank you everyone for attending our General Assembly in NCR and South Luzon with CPD on Pharmacovigilance! We hope to see you again on our future programs!</p>"
  },
  {
    "title": "Oath-Taking for New Filipino Pharmacists held in Manila",
    "date": "October 7, 2018",
    "url": "/oath-taking-of-new-pharmacists-september-2018",
    "fburl": "https://www.facebook.com/notes/ypg-philippines/oath-taking-for-new-filipino-pharmacists-held-in-manila/2428933533791090/?__tn__=-R",
    "image": "https://scontent.fcrk1-1.fna.fbcdn.net/v/t1.0-9/42231099_2389709757713468_5198894380928204800_n.jpg?_nc_cat=111&_nc_eui2=AeH439_McWskgXCSpM5IVFEpypUIVq6OYE6xkzXH6xpbOfVwVmxMOjZoQ_dDU2BxEwL-AbwcxzK6rRB8laFk5qKizw-cgg1oMHpZ-KJjDhHKpg&oh=cd9edd655ead0de1990a807477abe5a3&oe=5C16ACAD",
    "description": "<p>There are 2, 927 out of 4,230 who passed the Pharmacist Licensure Examination last August 4-5,2018. Newly registered pharmacists now had made an oath to devote their professional lives to the service of mankind through the pharmacy practice.</p><p>The oath-taking ceremony was held at the Plenary Hall, Philippine International Convention Center (PICC) last September 19, 2018, from 1:00 pm to 4:30 pm.</p><p>The event started with the procession of the Board Topnotchers together with their parents and relatives followed by the Deans of Schools and Colleges of Pharmacy, the Professional Regulation Commission (PRC) Board of Pharmacy - Hon. Adelina Royo (Chair), Hon. Mildred B. Oliveros and Hon. Anthony Aldrin C. Santiago (Members). The procession also includes the PRC Most Outstanding Professional Pharmacist 2018 and the current dean of University of Santo Tomas - Dean Aleth Therese Dacanay, PhD. The former chair of the Board of Pharmacy, Hon. Jennifer Flores also attended the event. Warm applause has welcomed them as the oath-taking ceremony officially started.</p><p>A joyous moment was there. The countless sleepless night was overcome. Congratulatory messages surrounded the newly registered pharmacists, family, friends, mentors and significant others who have stayed all throughout the season.</p><p>Plato once said, “The beginning is the most important part of the work.” The start of practice is here. Options on which oath to take are now unlocked and a decision is to be made. Several questions run in the minds of the newly registered pharmacists. Amidst the mixed emotions where happiness for the acquired success is dominating, a good guidance is to be sought. Founded on the inspirational message delivered by Dean Aleth Therese Dacanay, PhD., it is indeed a must to be consistent and persistent in whatever the choice of practice it may be. “Success stories do not happen overnight”, says Dean Dacanay. Hard work brings milestones and self-confidence defeats anxiety and uncertainty. It may not be easy but if it is worth having; then, it is worth doing. The hall was filled with full joy and excitement on what awaits them.</p><p>After those inspiring words, awarding followed. The awards were then presented to the top ten (10) board passers. On the tenth place is Mr Matthew Dominique Quinton Tan Ong from UP Manila. He was awarded by Ms Margarita Gutierrez, President of Young Pharmacists Group-Philippines.</p><p>In Ms Theunis’ speech, she expressed her gratitude to all the people who supported her and stayed with her through good and bad times. Thus, she believes that they are indeed to be treasured. She also shared what she did during her college days such as saying, “I love Pharmacy” during reviews and exams. Indeed, a part of what we are now is because of the past failures that we have overcome. What made us who we are and where we are is the courage to move forward. She said, “self-confidence defeats anxiety and depression.”</p><p>“This event was really memorable for us - newly registered pharmacists. It was the day that we were all waiting for and I can say that we really enjoyed the event.”, says Roselle D.C. Saludaga, RPh.</p><p>“It is one of the most memorable days in my life. It feels so good that I am a true professional now. I thank God for this kind of a blessing and for letting me have this kind of experience. Congratulations to all of the newly registered pharmacists.” says Angel Grace B. Reyes, RPh.</p><p>After the oath-taking ceremony, finally, they were able to claim their licenses. As a new journey begins, a new set of learning will come.</p>"
  },
  {
    "title": "Awarding of Board Topnotchers",
    "date": "September 19, 2018",
    "url": "/awarding-of-top-notcher-august-2018",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2389520414399069?__tn__=-R",
    "image": "https://scontent.fcrk1-1.fna.fbcdn.net/v/t1.0-9/42141759_2389520317732412_1772202836038254592_n.jpg?_nc_cat=101&_nc_eui2=AeGtRlIcMFNPqofcSARQLog--q2wydiEcIpwZBceNosXhVT4uk5Dh-LhOkX6HK7uSAAJ5piwMQ8RKG10pjUYC4gj4RVijnWgahtgUGUXsD2N6Q&oh=f67346e3971dfddcaaa31951c4f19d6b&oe=5C5B26EE",
    "description": "<p>The Young Pharmacists Group Philippines is honored to award the top 10th placer Mathew Dominique Quinton Tan Ong at the Oath Taking of New Pharmacists Ceremony</p><p>Congratulations New RPhs!</p>"
  },
  {
    "title": "YPG Tarlac Chapter Formation",
    "date": "September 9, 2018",
    "url": "/ypg-tarlac-chapter-formation",
    "fburl": "https://www.facebook.com/PhilsYPG/photos/a.990977737586684/2372867412731036/?type=3&theater",
    "image": "https://scontent.fcrk1-1.fna.fbcdn.net/v/t1.0-9/41385896_2372867419397702_5875101196015894528_o.jpg?_nc_cat=110&_nc_eui2=AeFf_hP42zYzq_DRMtLiV9YDg4CeSUUQYf50e8FcQsosMf9AFuRMii1iGfKFmgDZ0breq-e3sDbsnpMMb51pN-5fhpm0Ko144xO9TAhGcgi7MQ&oh=36a4e7f3336dfe3e4bd8fd5a472c92f0&oe=5C1D8E27",
    "description": "Congratulations ideal Young Pharmacists of YPG Tarlac Chapter for successfully creating your chapter."
  },
  {
    "title": "Regulatory Compliance Workshop",
    "date": "September 3, 2018",
    "url": "/regulatory-compliance-workshop",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2362171800467264?__xts__%5B0%5D=68.ARDteIpEsykVSoxScE2FfX6KrOwRbfJwTWuvMSKOIaECOtzgBwlH7RNUMCz_g65tzMmZdNQmI3MMn4bsazuFqFue69T0EMgTH_x0aS1sgEHoUDZ5pT8riITaCbg_2hmJ64DC2Iv8znyFkgoXIYX8TJYrqlTkhFV6Iqmq_7fhK-nSulIrHRE8RQ&__tn__=-R",
    "image": "https://scontent.fmnl17-1.fna.fbcdn.net/v/t1.0-9/40598996_2362163450468099_3019371243267686400_n.png?_nc_cat=0&_nc_eui2=AeGaiSX1w7O0xxLpeSe6omXnTrMhZKcQqIvnwFnFvB0mVCReR0dYJDzeuUkmvCp1Z3YdbKUEC0LHd8SFnZdvwrQoX41FI2_SJorJ-3Bva-2EZA&oh=0598edf35e637ad40f6c4140ec31c227&oe=5C24A1AC",
    "description": "YPG Philippines conducted a Regulatory Compliance Workshop facilitated by Atty. Lomibao, CPA to guide its officers on the various requirements needed for legal compliance of a national organization. Afterwards, the Administrative Council held its first meeting headed by the Executive Secretary, Katrice Lara, RPh."
  },
  {
    "title": "PPhA Strategic Planning",
    "date": "September 1, 2018",
    "url": "/ppha-strategic-planning",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2358586287492482?__tn__=-R",
    "image": "https://scontent.fmnl17-1.fna.fbcdn.net/v/t1.0-9/40623755_2358586294159148_3576734251690754048_n.jpg?_nc_cat=0&_nc_eui2=AeEc5Q-HmRWovrIXXasQ3GS5pnMX3fXIHTdpkQjxXw_paq33jgJ-6mokEnYGXFV2OMTJmeVch6JTgoroWlmkz1gkzpaFI9stRwQtt7M8VLHhHw&oh=39ae5808e5f5a30f30488548e44fd037&oe=5BF819BE",
    "description": "<p>Last August 24-26, 2018, YPG-Philippines actively took part in the PPhA Strategic Planning for the years 2018-2020 at Las Cas Filipinas de Acuzar in Bagac, Bataan. Together with PPhA former and present Board of Trustees, Council of Advisers and Affiliate Organization Presidents and Representatives, the group formulated recommendations for strategies towards achieving the vision and mission of PPhA as an association. Initial plans and proposals for the Centennial Celebration of PPhA set on the year 2020 were also tackled. </p><p>The YPG-Philippines delegation to the strategic planning was headed by our President Meg Gutierrez, RPh. In attendance as well were our Membership Coordinator, Alexander Lim , and our Communications and Media Relations Officer, Diana Dalisay Orolfo , RPh.</p> "
  },
  {
    "title": "YPG Bataan Chapter Formation",
    "date": "August 26, 2018",
    "url": "/ypg-bataan-chapter-formation",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2348372308513880?__tn__=-R",
    "image": "https://scontent.fmnl17-1.fna.fbcdn.net/v/t1.0-9/40093963_2348371401847304_8131802044127248384_n.jpg?_nc_cat=0&_nc_eui2=AeGeFa9tbkZGMCscjfu8QKhiIQ9DEnbWmq2ULM9mLd73RhKc8lWpDW0dqTCxwbEte98v1uisfvMuoN5KM5vK5nKkQV2O2PtQgVUBGrsQlg1hFg&oh=dad1837215912787ba0d058eaf06455e&oe=5BF2071A",
    "description": "<p>Today the YPG Philippines President, Ms. Meg Gutierrez personally awarded the YPG Bataan Chapter their certificate of formation. The certificate was received by their president, Ms. Erika Marteja and their officers.</p><p>Welcome to the family #IDEALPharmacists of YPG Bataan Chapter!</p>"
  },
  {
    "title": "YPG Tarlac Relaunch",
    "date": "August 12, 2018",
    "url": "/ypg-tarlac-relaunch",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2317164808301297?__tn__=-R",
    "image": "https://scontent.fmnl17-1.fna.fbcdn.net/v/t1.0-9/39069480_2317164608301317_9205784940346605568_n.jpg?_nc_cat=0&_nc_eui2=AeGTGAx0mqQjWX4htK0q_40IWWFtOViZ0kqFz5LUF8FUSptTzMAUyOJinXUIz5ZZm3YhwIJ-e4p_sigMfz6P5mlRQQiML7Srk0XV0x8b61ReKA&oh=bc1e4f70da5c6707483e0e08d880eb18&oe=5C2CE057",
    "description": "<p>To YPG Philippines, lets wholeheartedly welcome #idealPharmacists of YPG Tarlac Chapter.</p><p>Congratulations YPG Tarlac.</p>"
  },
  {
    "title": "Strategic Planning",
    "date": "July 21, 2018",
    "url": "/strategic-planning-2018",
    "fburl": "https://www.facebook.com/PhilsYPG/posts/2279023965448715?__tn__=-R",
    "image": "https://scontent.fmnl17-1.fna.fbcdn.net/v/t1.0-9/37869736_2279033558781089_7835576436030177280_o.jpg?_nc_cat=0&_nc_eui2=AeHlhojmjBojK0IuxiDUlGzd6gO5pHW63or0wLD2X2ut5ZZxt_DHmLLdsIQQUpobvXpfG85bgdxSaLMWmZGoqpGfeqFZNLUSE3c1esXXQQHMFg&oh=15c9e30bb2d87a57bc33a95e805289b0&oe=5C297602",
    "description": "<p>The 2018 YPG Strategic Planning was attended by YPG National Officers 2018-2020 at Parque Espana Residence Hotel on July 21-22, 2018. Activities conducted include leadership workshop, turnover ceremony and oath taking, and strategic planning.</p>"
  }
]
